doc/Примеры/статус квитирования начисления запрос.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <SOAP-ENV:Body wsu:Id="body">
      <n1:UnifoTransferMsg xsi:schemaLocation="http://roskazna.ru/SmevUnifoService/ MethodMsg.xsd" xmlns:chg="http://roskazna.ru/xsd/Charge" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:n1="http://roskazna.ru/SmevUnifoService/" xmlns:n3="http://www.altova.com/samplexml/other-namespace" xmlns:pdrq="http://roskazna.ru/xsd/PGU_DataRequest" xmlns:smev="http://smev.gosuslugi.ru/rev111111" xmlns:unifo="http://rosrazna.ru/xsd/SmevUnifoService" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <smev:Message>
            <smev:Sender>
               <smev:Code>RKZN35001</smev:Code>
               <smev:Name>Казначейство России</smev:Name>
            </smev:Sender>
            <smev:Recipient>
               <smev:Code>RKZN35001</smev:Code>
               <smev:Name>Казначейство России</smev:Name>
            </smev:Recipient>
            <smev:TypeCode>GFNC</smev:TypeCode>
            <smev:Status>REQUEST</smev:Status>
            <smev:Date>2012-07-25T09:30:48.0Z</smev:Date>
            <smev:ExchangeType>6</smev:ExchangeType>
         </smev:Message>
         <smev:MessageData>
            <smev:AppData>
               <unifo:exportData>
                  <pdrq:DataRequest kind="CHARGESTATUS">
                     <PostBlock>
                        <ID>1538442</ID>
                        <TimeStamp>2012-07-25T09:30:47.0Z</TimeStamp>
                        <SenderIdentifier>044525716</SenderIdentifier>
                     </PostBlock>
                     <SupplierBillIDs>
                        <SupplierBillID>19200000022336139015</SupplierBillID>
                     </SupplierBillIDs>
                  </pdrq:DataRequest>
               </unifo:exportData>
            </smev:AppData>
         </smev:MessageData>
      </n1:UnifoTransferMsg>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>